{
  "movies": [
    {
      "poster_path": "/b1IZRGJG8m0tCyYeBz6RKrjQnkF.jpg",
      "popularity": 2.200039,
      "id": 7166,
      "overview": "The Mighty Boosh is a British comedy television show created by Julian Barratt, Noel Fielding and others. The Mighty Boosh is a comic fantasy containing humour and pop-culture references. Episodes often featured elaborate musical numbers in different genres, such as electro, heavy metal, funk, and rap. The show has been known for popularising a style called \"crimping\"; short a cappella songs which are present throughout all three series. Julian Barratt wrote the music within the show, and performs it with Noel Fielding. Fielding also designed many of the show's graphics and artwork.\n\nThe TV series has many animated sequences, puppets and special effects. Barratt has said that he approached Fielding with the idea of doing a show like The Goodies, as if it were a complete \"world\" rather than simply a sketch show. Barratt and Fielding play many of the recurring and one-off characters themselves, with other characters being played by other Boosh members Rich Fulcher, Dave Brown, and Michael Fielding.",
      "backdrop_path": "/u3LeNutLAv2j3GwdYPAqdbtx3gv.jpg",
      "vote_average": 7.76,
      "media_type": "tv",
      "first_air_date": "2004-05-18",
      "origin_country": [
        "GB"
      ],
      "genre_ids": [
        35
      ],
      "original_language": "en",
      "vote_count": 29,
      "name": "The Mighty Boosh",
      "original_name": "The Mighty Boosh",
      "_id": 1
    },
    {
      "poster_path": "/d4cGpsSLays7WcxSDr3OmY8YyND.jpg",
      "popularity": 1.288686,
      "id": 205,
      "overview": "Garth Marenghi's Darkplace is a British dark comedy show made for Channel 4 by Matthew Holness and Richard Ayoade. Following on from Garth Marenghi's Netherhead, which won the 2001 Perrier Awards, the show revolves around fictional horror author Garth Marenghi and his publisher Dean Learner.\n\nDarkplace is presented as a lost classic: a television series produced in the 1980s, though never broadcast at the time. The presentation features commentary from many of the \"original\" cast, where characters such as \"Marenghi\" and \"Learner\" reflect on making the show. Darkplace parodies numerous aspects of '80s low-budget television, including fashion, special effects, production gaffes, and music, as well as the widespread practice of including commentary tracks on DVD releases of old films and television shows.\n\nDarkplace was broadcast in a late-night timeslot, with very little advertising, and met with poor viewing figures. The show nonetheless built up a significant internet following, leading Channel 4 to swiftly repeat the series and produce a DVD release. It was also reported that Channel 4's Film Four had asked Holness and Ayoade to write a script for a movie version of their programme.",
      "backdrop_path": "/8jIzy221ySzuhisaNHkYjG4LymA.jpg",
      "vote_average": 7.56,
      "media_type": "tv",
      "first_air_date": "2004-01-29",
      "origin_country": [
        "GB"
      ],
      "genre_ids": [
        35
      ],
      "original_language": "en",
      "vote_count": 25,
      "name": "Garth Marenghi's Darkplace",
      "original_name": "Garth Marenghi's Darkplace",
      "_id": 2
    },
    {
      "poster_path": "/2g0yrwH3wWfGfA6uXUPhtiQZYOx.jpg",
      "popularity": 3.400785,
      "id": 2490,
      "overview": "UK Comedy series about two I.T. nerds and their clueless female manager, who work in the basement of a very successful company. When they are called on for help, they are never treated with any respect at all.",
      "backdrop_path": "/fZoj7ZMLbBQjC8MvQjZ3XuzqLwp.jpg",
      "vote_average": 8.02,
      "media_type": "tv",
      "first_air_date": "2006-02-03",
      "origin_country": [
        "GB"
      ],
      "genre_ids": [
        35
      ],
      "original_language": "en",
      "vote_count": 223,
      "name": "The IT Crowd",
      "original_name": "The IT Crowd",
      "_id": 3
    },
    {
      "poster_path": "/hScBD7gt9kJR6Ty68zIaIHI2bIp.jpg",
      "popularity": 2.697225,
      "id": 2798,
      "overview": "Space Ghost: Coast to Coast is an American animated parody talk show, hosted by the 1960s Hanna-Barbera cartoon character Space Ghost. The show premiered on April 15, 1994, on Cartoon Network. Though the original 1960s series aired as a standard Hanna-Barbera Saturday morning superhero cartoon, Space Ghost Coast to Coast was a total reboot of the series intended for adults, now reinterpreted as an absurdist parody talk show and produced using the original artwork.\n\nThe series' focus on surrealism, non-sequiturs and random, unpredictable parody humor proved the perfect vehicle to launch the network's late night television block, Adult Swim, serving as the flagship show from 2001–2004. Space Ghost Coast to Coast was recommended to be the first fully produced series to air on Cartoon Network. SGC2C was also the first and only Cartoon Network original series to later air on Adult Swim and Gametap. The show was rated TV-Y7, TV-PG, and TV-14, making it the first and only Cartoon Network original show to receive these three TV ratings.",
      "backdrop_path": "/vkf62WWYiVpkByzFN4vVZ7pO8QP.jpg",
      "vote_average": 8,
      "media_type": "tv",
      "first_air_date": "1994-04-15",
      "origin_country": [
        "US"
      ],
      "genre_ids": [
        16,
        35
      ],
      "original_language": "en",
      "vote_count": 15,
      "name": "Space Ghost Coast to Coast",
      "original_name": "Space Ghost Coast to Coast",
      "_id": 5
    },
    {
      "poster_path": "/cqBCVCSWT7j5IOwsYQclroNyKcN.jpg",
      "popularity": 2.890565,
      "id": 334,
      "overview": "The year is 2021. Deep below the ocean's surface, looms a vast, magnificently high-tech compound: Sealab. A multi-national scientific station with an annual budget in the trillions, manned by a motley collection of malcontents and screw-ups who were unfit for work in the private sector. They really don't get any research done, but instead spend their time bickering among themselves or just plain goofing off. The crew have manipulated their luckless leader, Captain Murphy, into submission, and are content to ride the government clock, raking in fat, hazardous-duty paychecks.",
      "backdrop_path": "/b2pUcChCiv7wV1uafZrIVqbc5Vb.jpg",
      "vote_average": 7.83,
      "media_type": "tv",
      "first_air_date": "2000-12-21",
      "origin_country": [
        "US"
      ],
      "genre_ids": [
        16,
        35
      ],
      "original_language": "en",
      "vote_count": 18,
      "name": "Sealab 2021",
      "original_name": "Sealab 2021",
      "_id": 6
    }
  ],
  "posts": [
    {
      "id": 1,
      "title": "json-server",
      "author": "typicode"
    }
  ],
  "comments": [
    {
      "id": 1,
      "body": "some comment",
      "postId": 1
    }
  ],
  "profile": {
    "name": "typicode"
  }
}