{
  "movies": [
    {
      "poster_path": "/b1IZRGJG8m0tCyYeBz6RKrjQnkF.jpg",
      "popularity": 2.200039,
      "id": 7166,
      "overview": "The Mighty Boosh is a British comedy television show created by Julian Barratt, Noel Fielding and others. The Mighty Boosh is a comic fantasy containing humour and pop-culture references. Episodes often featured elaborate musical numbers in different genres, such as electro, heavy metal, funk, and rap. The show has been known for popularising a style called \"crimping\"; short a cappella songs which are present throughout all three series. Julian Barratt wrote the music within the show, and performs it with Noel Fielding. Fielding also designed many of the show's graphics and artwork.\n\nThe TV series has many animated sequences, puppets and special effects. Barratt has said that he approached Fielding with the idea of doing a show like The Goodies, as if it were a complete \"world\" rather than simply a sketch show. Barratt and Fielding play many of the recurring and one-off characters themselves, with other characters being played by other Boosh members Rich Fulcher, Dave Brown, and Michael Fielding.",
      "backdrop_path": "/u3LeNutLAv2j3GwdYPAqdbtx3gv.jpg",
      "vote_average": 7.76,
      "media_type": "tv",
      "first_air_date": "2004-05-18",
      "origin_country": [
        "GB"
      ],
      "genre_ids": [
        35
      ],
      "original_language": "en",
      "vote_count": 29,
      "name": "The Mighty Boosh",
      "original_name": "The Mighty Boosh",
      "_id": 1
    },
    {
      "poster_path": "/d4cGpsSLays7WcxSDr3OmY8YyND.jpg",
      "popularity": 1.288686,
      "id": 205,
      "overview": "Garth Marenghi's Darkplace is a British dark comedy show made for Channel 4 by Matthew Holness and Richard Ayoade. Following on from Garth Marenghi's Netherhead, which won the 2001 Perrier Awards, the show revolves around fictional horror author Garth Marenghi and his publisher Dean Learner.\n\nDarkplace is presented as a lost classic: a television series produced in the 1980s, though never broadcast at the time. The presentation features commentary from many of the \"original\" cast, where characters such as \"Marenghi\" and \"Learner\" reflect on making the show. Darkplace parodies numerous aspects of '80s low-budget television, including fashion, special effects, production gaffes, and music, as well as the widespread practice of including commentary tracks on DVD releases of old films and television shows.\n\nDarkplace was broadcast in a late-night timeslot, with very little advertising, and met with poor viewing figures. The show nonetheless built up a significant internet following, leading Channel 4 to swiftly repeat the series and produce a DVD release. It was also reported that Channel 4's Film Four had asked Holness and Ayoade to write a script for a movie version of their programme.",
      "backdrop_path": "/8jIzy221ySzuhisaNHkYjG4LymA.jpg",
      "vote_average": 7.56,
      "media_type": "tv",
      "first_air_date": "2004-01-29",
      "origin_country": [
        "GB"
      ],
      "genre_ids": [
        35
      ],
      "original_language": "en",
      "vote_count": 25,
      "name": "Garth Marenghi's Darkplace",
      "original_name": "Garth Marenghi's Darkplace",
      "_id": 2
    },
    {
      "poster_path": "/hScBD7gt9kJR6Ty68zIaIHI2bIp.jpg",
      "popularity": 2.697225,
      "id": 2798,
      "overview": "Space Ghost: Coast to Coast is an American animated parody talk show, hosted by the 1960s Hanna-Barbera cartoon character Space Ghost. The show premiered on April 15, 1994, on Cartoon Network. Though the original 1960s series aired as a standard Hanna-Barbera Saturday morning superhero cartoon, Space Ghost Coast to Coast was a total reboot of the series intended for adults, now reinterpreted as an absurdist parody talk show and produced using the original artwork.\n\nThe series' focus on surrealism, non-sequiturs and random, unpredictable parody humor proved the perfect vehicle to launch the network's late night television block, Adult Swim, serving as the flagship show from 2001–2004. Space Ghost Coast to Coast was recommended to be the first fully produced series to air on Cartoon Network. SGC2C was also the first and only Cartoon Network original series to later air on Adult Swim and Gametap. The show was rated TV-Y7, TV-PG, and TV-14, making it the first and only Cartoon Network original show to receive these three TV ratings.",
      "backdrop_path": "/vkf62WWYiVpkByzFN4vVZ7pO8QP.jpg",
      "vote_average": 8,
      "media_type": "tv",
      "first_air_date": "1994-04-15",
      "origin_country": [
        "US"
      ],
      "genre_ids": [
        16,
        35
      ],
      "original_language": "en",
      "vote_count": 15,
      "name": "Space Ghost Coast to Coast",
      "original_name": "Space Ghost Coast to Coast",
      "_id": 5
    },
    {
      "poster_path": "/cqBCVCSWT7j5IOwsYQclroNyKcN.jpg",
      "popularity": 2.890565,
      "id": 334,
      "overview": "The year is 2021. Deep below the ocean's surface, looms a vast, magnificently high-tech compound: Sealab. A multi-national scientific station with an annual budget in the trillions, manned by a motley collection of malcontents and screw-ups who were unfit for work in the private sector. They really don't get any research done, but instead spend their time bickering among themselves or just plain goofing off. The crew have manipulated their luckless leader, Captain Murphy, into submission, and are content to ride the government clock, raking in fat, hazardous-duty paychecks.",
      "backdrop_path": "/b2pUcChCiv7wV1uafZrIVqbc5Vb.jpg",
      "vote_average": 7.83,
      "media_type": "tv",
      "first_air_date": "2000-12-21",
      "origin_country": [
        "US"
      ],
      "genre_ids": [
        16,
        35
      ],
      "original_language": "en",
      "vote_count": 18,
      "name": "Sealab 2021",
      "original_name": "Sealab 2021",
      "_id": 6
    },
    {
      "poster_path": "/t5rr49hyqohaBPa2IW81P10IrsI.jpg",
      "popularity": 1.595168,
      "id": 6991,
      "overview": "The Drinky Crow Show is an American animated television series created by Eric Kaplan and Tony Millionaire, based on the latter's comic strip Maakies. The pilot episode aired on Cartoon Network's late night programing block, Adult Swim on May 13, 2007. The series premiered on November 23, 2008 and ended January 25, 2009. The cancellation of the show was confirmed by a Maakies comic.\n\nDino Stamatopoulos provided the voice of the titular character and David Herman the voices of Uncle Gabby and Captain Maak. Millionaire's wife Becky Thyre co-starred as the voice of the Captain's Daughter and Phoebe Bird. Pamela Adlon provided the voice of Mademoiselle DeBoursay, as well as many of the other female characters. Creators Tony Millionaire and Eric Kaplan also provided additional voices. They Might Be Giants perform the show's theme song.",
      "backdrop_path": "/2GAkdgIUYNvARd8CI6qn6wGNso5.jpg",
      "vote_average": 7,
      "media_type": "tv",
      "first_air_date": "2008-11-23",
      "origin_country": [
        "US"
      ],
      "genre_ids": [
        16,
        35
      ],
      "original_language": "en",
      "vote_count": 1,
      "name": "The Drinky Crow Show",
      "original_name": "The Drinky Crow Show",
      "_id": 8
    },
    {
      "poster_path": "/2g0yrwH3wWfGfA6uXUPhtiQZYOx.jpg",
      "popularity": 3.400785,
      "id": 2490,
      "overview": "UK Comedy series about two I.T. nerds and their clueless female manager, who work in the basement of a very successful company. When they are called on for help, they are never treated with any respect at all.",
      "backdrop_path": "/fZoj7ZMLbBQjC8MvQjZ3XuzqLwp.jpg",
      "vote_average": 8.02,
      "media_type": "tv",
      "first_air_date": "2006-02-03",
      "origin_country": [
        "GB"
      ],
      "genre_ids": [
        35
      ],
      "original_language": "en",
      "vote_count": 223,
      "name": "The IT Crowd",
      "original_name": "The IT Crowd",
      "_id": 9
    },
    {
      "poster_path": "/qgxnwCFs5sZcfVeOqxh5AK7maBp.jpg",
      "popularity": 1.214909,
      "id": 2166,
      "overview": "Cartoon Planet is an animated variety show that originally ran from 1995 to 1998, and from March 30, 2012 to present on Cartoon Network. A spin-off of the animated Space Ghost Coast to Coast talk show, the original premise was that Space Ghost had recruited his imprisoned evil arch nemesis Zorak and his loud and extremely dimwitted archenemy Brak to assist him in hosting a variety show.\n\nCartoon Planet began as an hour-long block of cartoons hosted by Space Ghost, Zorak, and Brak. They would introduce full cartoons from the Turner Entertainment library, such as old theatrical shorts and Hanna-Barbera cartoons, including the original 1960s Space Ghost episodes. The host segments were often original songs and ad libbed skits. New material ceased being made in 1997, and most of the songs and skits were re-packaged into 22 half-hour episodes without cartoons.",
      "backdrop_path": "/hDi1O8CLAOMumMMxlsz0Eb0utVC.jpg",
      "vote_average": 0,
      "media_type": "tv",
      "first_air_date": "1995-09-10",
      "origin_country": [
        "US"
      ],
      "genre_ids": [
        16,
        35
      ],
      "original_language": "en",
      "vote_count": 0,
      "name": "Cartoon Planet",
      "original_name": "Cartoon Planet",
      "_id": 10
    },
    {
      "poster_path": "/rSZs93P0LLxqlVEbI001UKoeCQC.jpg",
      "adult": false,
      "overview": "A fading actor best known for his portrayal of a popular superhero attempts to mount a comeback by appearing in a Broadway play. As opening night approaches, his attempts to become more altruistic, rebuild his career, and reconnect with friends and family prove more difficult than expected.",
      "release_date": "2014-08-27",
      "original_title": "Birdman",
      "genre_ids": [
        18,
        35
      ],
      "id": 194662,
      "media_type": "movie",
      "original_language": "en",
      "title": "Birdman",
      "backdrop_path": "/hUDEHvhNJLNcb83Pp7xnFn0Wj09.jpg",
      "popularity": 10.141342,
      "vote_count": 3757,
      "video": false,
      "vote_average": 7.4,
      "_id": 11
    },
    {
      "poster_path": "/tO0Z5AV5vC1iZr1UYXHoAkr5gCz.jpg",
      "popularity": 2.311788,
      "id": 416,
      "overview": "Harvey Birdman, Attorney at Law features ex-superhero Harvey T. Birdman of Birdman and the Galaxy Trio as an attorney working for a law firm alongside other cartoon stars from 1960s and 1970s Hanna-Barbera cartoon series. Similarly, Harvey's clients are also primarily composed of characters taken from Hanna-Barbera cartoon series of the same era. Many of Birdman's nemeses featured in his former cartoon series also became attorneys, often representing the opposing side of a given case.",
      "backdrop_path": "/vWiWqloVtnCYGfbALWznQFRJtWk.jpg",
      "vote_average": 8.3,
      "media_type": "tv",
      "first_air_date": "2000-12-30",
      "origin_country": [
        "US"
      ],
      "genre_ids": [
        10765,
        16,
        35
      ],
      "original_language": "en",
      "vote_count": 15,
      "name": "Harvey Birdman, Attorney at Law",
      "original_name": "Harvey Birdman, Attorney at Law",
      "_id": 12
    },
    {
      "poster_path": "/ftOtiQPpH3cMCCR0Wp0nnsGm8RJ.jpg",
      "adult": false,
      "overview": "The winner (Carole Laure) of the Miss World Virginity contest marries, escapes from her masochistic husband and ends up involved in a world of debauchery.",
      "release_date": "1974-06-12",
      "original_title": "Sweet Movie",
      "genre_ids": [
        9648,
        35,
        18
      ],
      "id": 1559,
      "media_type": "movie",
      "original_language": "en",
      "title": "Sweet Movie",
      "backdrop_path": "/qDbdpCk5pcEIPLTDdmjPe3DP0BS.jpg",
      "popularity": 1.085922,
      "vote_count": 30,
      "video": false,
      "vote_average": 5.6,
      "_id": 13
    },
    {
      "poster_path": "/vuVk3SOhEUQnqEs29hM9IjqTGXB.jpg",
      "adult": false,
      "overview": "Olga is a complex young woman desperate to break free from her unfeeling family and social conventions. With her Louise Brooks-like tomboyish looks she drags herself, chain-smoking, from one job to another until she appears to find her niche as a truck driver. Although she has female lovers she does not form a bond with any of them; instead she clashes, time and again, venting herself in wordless emotional outbursts and other behavioural extremes.",
      "release_date": "2016-03-24",
      "original_title": "Já, Olga Hepnarová",
      "genre_ids": [
        18,
        36
      ],
      "id": 382143,
      "media_type": "movie",
      "original_language": "cs",
      "title": "I, Olga Hepnarova",
      "backdrop_path": "/vuP93Du92pvURwjwbnFLuNaNTei.jpg",
      "popularity": 1.171266,
      "vote_count": 8,
      "video": false,
      "vote_average": 8.1,
      "_id": 14
    },
    {
      "poster_path": "/kBI3kM9kB5E97I7iwsG0z0WAQhb.jpg",
      "adult": false,
      "overview": "The mad and evil scientist, Dr. Clayton Forrester, has created an evil little scheme that is bound to give him world global domination but first things first. He plans to torment Mike Nelson and the robots by sending them a real stinker of a film to watch called, \"This Island Earth.\" He is convinced that this movie will drive them insane. Will this be the ultimate cheese that breaks the boys' spirits?",
      "release_date": "1996-04-19",
      "original_title": "Mystery Science Theater 3000: The Movie",
      "genre_ids": [
        35,
        878
      ],
      "id": 3065,
      "media_type": "movie",
      "original_language": "en",
      "title": "Mystery Science Theater 3000: The Movie",
      "backdrop_path": "/JsXy2Gnq5zpbUwezEDkIR1wVcN.jpg",
      "popularity": 1.118379,
      "vote_count": 65,
      "video": false,
      "vote_average": 6.9,
      "_id": 15
    },
    {
      "poster_path": "/u8HQzZyBzc4I3v0HcRv5EgNfMBR.jpg",
      "adult": false,
      "overview": "A Mexican master leads a Christ figure and other disciples to a mountain of immortal wise men.",
      "release_date": "1973-05-01",
      "original_title": "The Holy Mountain",
      "genre_ids": [
        18
      ],
      "id": 8327,
      "media_type": "movie",
      "original_language": "en",
      "title": "The Holy Mountain",
      "backdrop_path": "/rDraIKqTIzptvCCkyY5sHKRBm8X.jpg",
      "popularity": 1.595884,
      "vote_count": 110,
      "video": false,
      "vote_average": 7.8,
      "_id": 16
    },
    {
      "poster_path": "/4kggRn855GvcVm6sl17zDYD3jqA.jpg",
      "adult": false,
      "overview": "El Topo decides to confront warrior Masters on a trans-formative desert journey he begins with his 6 year old son, who must bury his childhood totems to become a man. El Topo (the mole) claims to be God, while dressed as a gunfighter in black, riding a horse through a spiritual, mystical landscape strewn with old Western movie, and ancient Eastern religious symbols. Bandits slaughtered a village on his path, so El Topo avenges the massacred, then forcibly takes their leader's woman Mara as his. El Topo's surreal way is bloody, sexual and self-reflective, musing of his own demons, as he tries to vanquish those he encounters.",
      "release_date": "1970-12-18",
      "original_title": "El Topo",
      "genre_ids": [
        28,
        12,
        18,
        37
      ],
      "id": 13041,
      "media_type": "movie",
      "original_language": "es",
      "title": "El Topo",
      "backdrop_path": "/qfNSG6VzyxtGj83q0Vio44CruUv.jpg",
      "popularity": 1.269042,
      "vote_count": 84,
      "video": false,
      "vote_average": 7.3,
      "_id": 17
    },
    {
      "poster_path": "/dY3ZEMAZtddkKXpx7I4HRdEGS0A.jpg",
      "popularity": 1.805456,
      "id": 481,
      "overview": "The Brak Show is an animated television series that aired on Cartoon Network's late night programming block, Adult Swim. The Brak Show is a spin-off of the animated television series, Space Ghost Coast to Coast, and featured recurring characters from Space Ghost Coast to Coast and Cartoon Planet. Both programs used stock footage from the Hanna-Barbera cartoon Space Ghost. The protagonist is Brak, voiced by Andy Merrill, who developed a quirky persona for the character.\n\nAn earlier version of the pilot episode, \"Mr. Bawk Ba Gawk\", originally aired prior to the official launch of Adult Swim on Cartoon Network on December 21, 2000, as part of a preview of upcoming Adult Swim shows. The series made its official debut during the night Adult Swim officially launched on September 2, 2001, and ended on December 31, 2003, with a total of 28 episodes. On May 24, 2007 a webisode for the series was released on Adult Swim Video, ending the series.",
      "backdrop_path": "/vqXTxBpy1GXQF7KeruGYdVnNXY8.jpg",
      "vote_average": 7,
      "media_type": "tv",
      "first_air_date": "2000-12-21",
      "origin_country": [
        "CA",
        "US"
      ],
      "genre_ids": [
        16,
        35
      ],
      "original_language": "en",
      "vote_count": 9,
      "name": "The Brak Show",
      "original_name": "The Brak Show",
      "_id": 18
    },
    {
      "poster_path": "/r47O9K1w1wtM6hDlSpdAmxlBfGM.jpg",
      "adult": false,
      "overview": "Two teenage girls, both named Marie, decide that since the world is spoiled they will be spoiled as well; accordingly they embark on a series of destructive pranks in which they consume and destroy the world about them. This freewheeling, madcap feminist farce was immediately banned by the government.",
      "release_date": "1966-12-30",
      "original_title": "Sedmikrásky",
      "genre_ids": [
        18,
        35
      ],
      "id": 46919,
      "media_type": "movie",
      "original_language": "cs",
      "title": "Daisies",
      "backdrop_path": "/tUzmtDfbljvuyP1KmcOQFhMqzHX.jpg",
      "popularity": 1.081882,
      "vote_count": 44,
      "video": false,
      "vote_average": 7.2,
      "_id": 19
    }
  ],
  "posts": [
    {
      "id": 1,
      "title": "json-server",
      "author": "typicode"
    }
  ],
  "comments": [
    {
      "id": 1,
      "body": "some comment",
      "postId": 1
    }
  ],
  "profile": {
    "name": "typicode"
  }
}